import type { Orders } from "../types/OrdersType";

// const orders: Orders = {
//   clothesTypes: {
//     header: [
//       "بافت و سویشرت",
//       "شال و روسری",
//       "شومیز زنانه",
//       " لباس ورزشی",
//       " کیف زنانه",
//       " شلوار زنانه",
//       " کفش زنانه",
//     ],
//     contents: {
//       titleclothetypes: ["سویشرت", "هودی", "شال گردن", "دستکش", "جلیقه"],
//       scarftype: [
//         "شال ",
//         " روسری",
//         " شال بلند",
//         " بی بی اسکارف ",
//         " شال مجلسی",
//       ],
//       shomiztype: [
//         "شومیز مجلسی ",
//         " شومیز بیسیک",
//         " شومیز کراپ ",
//         " شومیز مشکی",
//       ],
//       sportstype: [
//         "نیم نته ",
//         " شورتک",
//         " ست ورزشی",
//         " سرهمی ورزشی",
//         " ساک ورزشی",
//         " شیکر",
//       ],
//       bagtype: ["کیف پول ", " کیف دوشی", " کوله"],
//       pantstype: ["شلوار پارچه ای ", " شلوار راحتی", " شلوار اسلش"],
//       shoetype: ["کفش زنانه "],
//     },
//   },
//   brands: {
//     header: [
//       "محصولات مک ",
//       " محصولات نارس",
//       " محصولات بنفیت",
//       " محصولات بالم",
//       " محصولات لافارر",
//     ],
//   },
//   electrovicels: {
//     header: ["اتو مو ", " شیور", " ماساژور", " شیور بینی"],
//   },
//   Personalhygiene: {
//     header: ["مام اسپری", " برس", " اسپری بدن "],
//   },
//   perfume: {
//     header: ["مردانه", "زنانه"],
//     mancontent: ["ادو پروفیم ", " ادو اونتوس", " ادو ساواج"],
//     womencontent: [" باکارت", " فراگنس", " اسکلاره", " اچ کوپز"],
//   },
//   skincare: {
//     header: ["مرطوب کننده", "کرم ترک پا"],
//   },
//   haircare: {
//     header: ["شامپو ", " ماسک مو", " روغن آرگان"],
//   },
// };

// export default orders;

const orders: Orders = {
  clothesTypes: {
    header: [
      "بافت و سویشرت",
      "شال و روسری",
      "شومیز زنانه",
      "لباس ورزشی",
      "کیف زنانه",
      "شلوار زنانه",
      "کفش زنانه",
    ],
    contents: {
      سویشرت: ["سویشرت", "هودی", "جلیقه"],
      شال: ["شال", "روسری", "شال مجلسی"],
      شومیز: ["شومیز مجلسی", "شومیز بیسیک"],
      ورزشی: ["ست ورزشی", "ساک ورزشی"],
      کیف: ["کیف دوشی", "کوله"],
      شلوار: ["پارچه‌ای", "راحتی", "اسلش"],
      کفش: ["کفش زنانه"],
    },
  },

  brands: {
    header: [
      "محصولات مک",
      "محصولات نارس",
      "محصولات بنفیت",
      "محصولات بالم",
      "محصولات لافارر",
    ],
    contents: {
      برندها: ["مک", "نارس", "بنفیت", "بالم", "لافارر"],
    },
  },

  electrovicels: {
    header: ["اتو مو", "شیور", "ماساژور", "شیور بینی"],
    contents: {
      لوازم: ["اتو مو", "شیور", "ماشین اصلاح", "ماساژور"],
    },
  },

  Personalhygiene: {
    header: ["مام اسپری", "برس", "اسپری بدن"],
    contents: {
      بهداشت: ["مام", "اسپری", "برس"],
    },
  },

  perfume: {
    header: ["مردانه", "زنانه"],
    contents: {
      مردانه: ["ادو پرفیوم", "ساواج", "اونتوس"],
      زنانه: ["باکارات", "فراگنس", "اسکلاره"],
    },
  },

  skincare: {
    header: ["مرطوب کننده", "کرم ترک پا"],
    contents: {
      پوست: ["مرطوب کننده", "کرم", "ماسک"],
    },
  },

  haircare: {
    header: ["شامپو", "ماسک مو", "روغن آرگان"],
    contents: {
      مو: ["شامپو", "ماسک مو", "روغن آرگان"],
    },
  },
};

export default orders;
